/* automatically generated by rust-bindgen 0.72.1 */

pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_CXX26: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _CRT_HAS_C11: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;
pub const __GOT_SECURE_LIB__: u32 = 200411;
pub const __STDC_WANT_SECURE_LIB__: u32 = 1;
pub const _SECURECRT_FILL_BUFFER_PATTERN: u32 = 254;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_COUNT: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 1;

pub const SEEK_END: u32 = 2;
pub const SEEK_SET: u32 = 0;
pub const FILENAME_MAX: u32 = 260;
pub const FOPEN_MAX: u32 = 20;
pub const _SYS_OPEN: u32 = 20;
pub const TMP_MAX: u32 = 2147483647;
pub const TMP_MAX_S: u32 = 2147483647;
pub const _TMP_MAX_S: u32 = 2147483647;
pub const SYS_OPEN: u32 = 20;
pub const GGML_FILE_MAGIC: u32 = 1734831468;
pub const GGML_FILE_VERSION: u32 = 2;
pub const GGML_QNT_VERSION: u32 = 2;
pub const GGML_QNT_VERSION_FACTOR: u32 = 1000;
pub const GGML_MAX_DIMS: u32 = 4;
pub const GGML_MAX_PARAMS: u32 = 2048;
pub const GGML_MAX_SRC: u32 = 10;
pub const GGML_MAX_N_THREADS: u32 = 512;
pub const GGML_MAX_OP_PARAMS: u32 = 64;
pub const GGML_MAX_NAME: u32 = 64;
pub const GGML_DEFAULT_N_THREADS: u32 = 4;
pub const GGML_DEFAULT_GRAPH_SIZE: u32 = 2048;
pub const GGML_MEM_ALIGN: u32 = 16;
pub const GGML_EXIT_SUCCESS: u32 = 0;
pub const GGML_EXIT_ABORTED: u32 = 1;
pub const GGML_ROPE_TYPE_NORMAL: u32 = 0;
pub const GGML_ROPE_TYPE_NEOX: u32 = 2;
pub const GGML_ROPE_TYPE_MROPE: u32 = 8;
pub const GGML_ROPE_TYPE_VISION: u32 = 24;
pub const GGML_ROPE_TYPE_IMROPE: u32 = 40;
pub const GGML_MROPE_SECTIONS: u32 = 4;
pub const GGML_KQ_MASK_PAD: u32 = 64;
pub const GGML_N_TASKS_MAX: i32 = -1;
pub const WHISPER_SAMPLE_RATE: u32 = 16000;
pub const WHISPER_N_FFT: u32 = 400;
pub const WHISPER_HOP_LENGTH: u32 = 160;
pub const WHISPER_CHUNK_SIZE: u32 = 30;
pub type wchar_t = ::std::os::raw::c_ushort;
pub type max_align_t = f64;
pub type va_list = *mut ::std::os::raw::c_char;
pub type __vcrt_bool = bool;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type __crt_bool = bool;
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
  pub _locale_pctype: *const ::std::os::raw::c_ushort,
  pub _locale_mb_cur_max: ::std::os::raw::c_int,
  pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of __crt_locale_data_public"][::std::mem::size_of::<__crt_locale_data_public>() - 16usize];
  ["Alignment of __crt_locale_data_public"]
    [::std::mem::align_of::<__crt_locale_data_public>() - 8usize];
  ["Offset of field: __crt_locale_data_public::_locale_pctype"]
    [::std::mem::offset_of!(__crt_locale_data_public, _locale_pctype) - 0usize];
  ["Offset of field: __crt_locale_data_public::_locale_mb_cur_max"]
    [::std::mem::offset_of!(__crt_locale_data_public, _locale_mb_cur_max) - 8usize];
  ["Offset of field: __crt_locale_data_public::_locale_lc_codepage"]
    [::std::mem::offset_of!(__crt_locale_data_public, _locale_lc_codepage) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
  pub locinfo: *mut __crt_locale_data,
  pub mbcinfo: *mut __crt_multibyte_data,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of __crt_locale_pointers"][::std::mem::size_of::<__crt_locale_pointers>() - 16usize];
  ["Alignment of __crt_locale_pointers"][::std::mem::align_of::<__crt_locale_pointers>() - 8usize];
  ["Offset of field: __crt_locale_pointers::locinfo"]
    [::std::mem::offset_of!(__crt_locale_pointers, locinfo) - 0usize];
  ["Offset of field: __crt_locale_pointers::mbcinfo"]
    [::std::mem::offset_of!(__crt_locale_pointers, mbcinfo) - 8usize];
};
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
  pub _Wchar: ::std::os::raw::c_ulong,
  pub _Byte: ::std::os::raw::c_ushort,
  pub _State: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _Mbstatet"][::std::mem::size_of::<_Mbstatet>() - 8usize];
  ["Alignment of _Mbstatet"][::std::mem::align_of::<_Mbstatet>() - 4usize];
  ["Offset of field: _Mbstatet::_Wchar"][::std::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
  ["Offset of field: _Mbstatet::_Byte"][::std::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
  ["Offset of field: _Mbstatet::_State"][::std::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _iobuf {
  pub _Placeholder: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _iobuf"][::std::mem::size_of::<_iobuf>() - 8usize];
  ["Alignment of _iobuf"][::std::mem::align_of::<_iobuf>() - 8usize];
  ["Offset of field: _iobuf::_Placeholder"][::std::mem::offset_of!(_iobuf, _Placeholder) - 0usize];
};
pub type FILE = _iobuf;
pub type fpos_t = ::std::os::raw::c_longlong;
pub type ggml_abort_callback_t =
  ::std::option::Option<unsafe extern "C" fn(error_message: *const ::std::os::raw::c_char)>;
pub const ggml_status_GGML_STATUS_ALLOC_FAILED: ggml_status = -2;
pub const ggml_status_GGML_STATUS_FAILED: ggml_status = -1;
pub const ggml_status_GGML_STATUS_SUCCESS: ggml_status = 0;
pub const ggml_status_GGML_STATUS_ABORTED: ggml_status = 1;
pub type ggml_status = ::std::os::raw::c_int;
pub type ggml_fp16_t = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_bf16_t {
  pub bits: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ggml_bf16_t"][::std::mem::size_of::<ggml_bf16_t>() - 2usize];
  ["Alignment of ggml_bf16_t"][::std::mem::align_of::<ggml_bf16_t>() - 2usize];
  ["Offset of field: ggml_bf16_t::bits"][::std::mem::offset_of!(ggml_bf16_t, bits) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_object {
  _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_context {
  _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_cgraph {
  _unused: [u8; 0],
}
pub const ggml_type_GGML_TYPE_F32: ggml_type = 0;
pub const ggml_type_GGML_TYPE_F16: ggml_type = 1;
pub const ggml_type_GGML_TYPE_Q4_0: ggml_type = 2;
pub const ggml_type_GGML_TYPE_Q4_1: ggml_type = 3;
pub const ggml_type_GGML_TYPE_Q5_0: ggml_type = 6;
pub const ggml_type_GGML_TYPE_Q5_1: ggml_type = 7;
pub const ggml_type_GGML_TYPE_Q8_0: ggml_type = 8;
pub const ggml_type_GGML_TYPE_Q8_1: ggml_type = 9;
pub const ggml_type_GGML_TYPE_Q2_K: ggml_type = 10;
pub const ggml_type_GGML_TYPE_Q3_K: ggml_type = 11;
pub const ggml_type_GGML_TYPE_Q4_K: ggml_type = 12;
pub const ggml_type_GGML_TYPE_Q5_K: ggml_type = 13;
pub const ggml_type_GGML_TYPE_Q6_K: ggml_type = 14;
pub const ggml_type_GGML_TYPE_Q8_K: ggml_type = 15;
pub const ggml_type_GGML_TYPE_IQ2_XXS: ggml_type = 16;
pub const ggml_type_GGML_TYPE_IQ2_XS: ggml_type = 17;
pub const ggml_type_GGML_TYPE_IQ3_XXS: ggml_type = 18;
pub const ggml_type_GGML_TYPE_IQ1_S: ggml_type = 19;
pub const ggml_type_GGML_TYPE_IQ4_NL: ggml_type = 20;
pub const ggml_type_GGML_TYPE_IQ3_S: ggml_type = 21;
pub const ggml_type_GGML_TYPE_IQ2_S: ggml_type = 22;
pub const ggml_type_GGML_TYPE_IQ4_XS: ggml_type = 23;
pub const ggml_type_GGML_TYPE_I8: ggml_type = 24;
pub const ggml_type_GGML_TYPE_I16: ggml_type = 25;
pub const ggml_type_GGML_TYPE_I32: ggml_type = 26;
pub const ggml_type_GGML_TYPE_I64: ggml_type = 27;
pub const ggml_type_GGML_TYPE_F64: ggml_type = 28;
pub const ggml_type_GGML_TYPE_IQ1_M: ggml_type = 29;
pub const ggml_type_GGML_TYPE_BF16: ggml_type = 30;
pub const ggml_type_GGML_TYPE_TQ1_0: ggml_type = 34;
pub const ggml_type_GGML_TYPE_TQ2_0: ggml_type = 35;
pub const ggml_type_GGML_TYPE_MXFP4: ggml_type = 39;
pub const ggml_type_GGML_TYPE_COUNT: ggml_type = 40;
pub type ggml_type = ::std::os::raw::c_int;
pub const ggml_prec_GGML_PREC_DEFAULT: ggml_prec = 0;
pub const ggml_prec_GGML_PREC_F32: ggml_prec = 10;
pub type ggml_prec = ::std::os::raw::c_int;
pub const ggml_ftype_GGML_FTYPE_UNKNOWN: ggml_ftype = -1;
pub const ggml_ftype_GGML_FTYPE_ALL_F32: ggml_ftype = 0;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_F16: ggml_ftype = 1;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_Q4_0: ggml_ftype = 2;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_Q4_1: ggml_ftype = 3;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_Q4_1_SOME_F16: ggml_ftype = 4;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_Q8_0: ggml_ftype = 7;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_Q5_0: ggml_ftype = 8;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_Q5_1: ggml_ftype = 9;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_Q2_K: ggml_ftype = 10;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_Q3_K: ggml_ftype = 11;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_Q4_K: ggml_ftype = 12;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_Q5_K: ggml_ftype = 13;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_Q6_K: ggml_ftype = 14;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_IQ2_XXS: ggml_ftype = 15;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_IQ2_XS: ggml_ftype = 16;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_IQ3_XXS: ggml_ftype = 17;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_IQ1_S: ggml_ftype = 18;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_IQ4_NL: ggml_ftype = 19;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_IQ3_S: ggml_ftype = 20;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_IQ2_S: ggml_ftype = 21;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_IQ4_XS: ggml_ftype = 22;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_IQ1_M: ggml_ftype = 23;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_BF16: ggml_ftype = 24;
pub const ggml_ftype_GGML_FTYPE_MOSTLY_MXFP4: ggml_ftype = 25;
pub type ggml_ftype = ::std::os::raw::c_int;
pub const ggml_op_GGML_OP_NONE: ggml_op = 0;
pub const ggml_op_GGML_OP_DUP: ggml_op = 1;
pub const ggml_op_GGML_OP_ADD: ggml_op = 2;
pub const ggml_op_GGML_OP_ADD_ID: ggml_op = 3;
pub const ggml_op_GGML_OP_ADD1: ggml_op = 4;
pub const ggml_op_GGML_OP_ACC: ggml_op = 5;
pub const ggml_op_GGML_OP_SUB: ggml_op = 6;
pub const ggml_op_GGML_OP_MUL: ggml_op = 7;
pub const ggml_op_GGML_OP_DIV: ggml_op = 8;
pub const ggml_op_GGML_OP_SQR: ggml_op = 9;
pub const ggml_op_GGML_OP_SQRT: ggml_op = 10;
pub const ggml_op_GGML_OP_LOG: ggml_op = 11;
pub const ggml_op_GGML_OP_SIN: ggml_op = 12;
pub const ggml_op_GGML_OP_COS: ggml_op = 13;
pub const ggml_op_GGML_OP_SUM: ggml_op = 14;
pub const ggml_op_GGML_OP_SUM_ROWS: ggml_op = 15;
pub const ggml_op_GGML_OP_CUMSUM: ggml_op = 16;
pub const ggml_op_GGML_OP_MEAN: ggml_op = 17;
pub const ggml_op_GGML_OP_ARGMAX: ggml_op = 18;
pub const ggml_op_GGML_OP_COUNT_EQUAL: ggml_op = 19;
pub const ggml_op_GGML_OP_REPEAT: ggml_op = 20;
pub const ggml_op_GGML_OP_REPEAT_BACK: ggml_op = 21;
pub const ggml_op_GGML_OP_CONCAT: ggml_op = 22;
pub const ggml_op_GGML_OP_SILU_BACK: ggml_op = 23;
pub const ggml_op_GGML_OP_NORM: ggml_op = 24;
pub const ggml_op_GGML_OP_RMS_NORM: ggml_op = 25;
pub const ggml_op_GGML_OP_RMS_NORM_BACK: ggml_op = 26;
pub const ggml_op_GGML_OP_GROUP_NORM: ggml_op = 27;
pub const ggml_op_GGML_OP_L2_NORM: ggml_op = 28;
pub const ggml_op_GGML_OP_MUL_MAT: ggml_op = 29;
pub const ggml_op_GGML_OP_MUL_MAT_ID: ggml_op = 30;
pub const ggml_op_GGML_OP_OUT_PROD: ggml_op = 31;
pub const ggml_op_GGML_OP_SCALE: ggml_op = 32;
pub const ggml_op_GGML_OP_SET: ggml_op = 33;
pub const ggml_op_GGML_OP_CPY: ggml_op = 34;
pub const ggml_op_GGML_OP_CONT: ggml_op = 35;
pub const ggml_op_GGML_OP_RESHAPE: ggml_op = 36;
pub const ggml_op_GGML_OP_VIEW: ggml_op = 37;
pub const ggml_op_GGML_OP_PERMUTE: ggml_op = 38;
pub const ggml_op_GGML_OP_TRANSPOSE: ggml_op = 39;
pub const ggml_op_GGML_OP_GET_ROWS: ggml_op = 40;
pub const ggml_op_GGML_OP_GET_ROWS_BACK: ggml_op = 41;
pub const ggml_op_GGML_OP_SET_ROWS: ggml_op = 42;
pub const ggml_op_GGML_OP_DIAG: ggml_op = 43;
pub const ggml_op_GGML_OP_DIAG_MASK_INF: ggml_op = 44;
pub const ggml_op_GGML_OP_DIAG_MASK_ZERO: ggml_op = 45;
pub const ggml_op_GGML_OP_SOFT_MAX: ggml_op = 46;
pub const ggml_op_GGML_OP_SOFT_MAX_BACK: ggml_op = 47;
pub const ggml_op_GGML_OP_ROPE: ggml_op = 48;
pub const ggml_op_GGML_OP_ROPE_BACK: ggml_op = 49;
pub const ggml_op_GGML_OP_CLAMP: ggml_op = 50;
pub const ggml_op_GGML_OP_CONV_TRANSPOSE_1D: ggml_op = 51;
pub const ggml_op_GGML_OP_IM2COL: ggml_op = 52;
pub const ggml_op_GGML_OP_IM2COL_BACK: ggml_op = 53;
pub const ggml_op_GGML_OP_IM2COL_3D: ggml_op = 54;
pub const ggml_op_GGML_OP_CONV_2D: ggml_op = 55;
pub const ggml_op_GGML_OP_CONV_3D: ggml_op = 56;
pub const ggml_op_GGML_OP_CONV_2D_DW: ggml_op = 57;
pub const ggml_op_GGML_OP_CONV_TRANSPOSE_2D: ggml_op = 58;
pub const ggml_op_GGML_OP_POOL_1D: ggml_op = 59;
pub const ggml_op_GGML_OP_POOL_2D: ggml_op = 60;
pub const ggml_op_GGML_OP_POOL_2D_BACK: ggml_op = 61;
pub const ggml_op_GGML_OP_UPSCALE: ggml_op = 62;
pub const ggml_op_GGML_OP_PAD: ggml_op = 63;
pub const ggml_op_GGML_OP_PAD_REFLECT_1D: ggml_op = 64;
pub const ggml_op_GGML_OP_ROLL: ggml_op = 65;
pub const ggml_op_GGML_OP_ARANGE: ggml_op = 66;
pub const ggml_op_GGML_OP_TIMESTEP_EMBEDDING: ggml_op = 67;
pub const ggml_op_GGML_OP_ARGSORT: ggml_op = 68;
pub const ggml_op_GGML_OP_LEAKY_RELU: ggml_op = 69;
pub const ggml_op_GGML_OP_TRI: ggml_op = 70;
pub const ggml_op_GGML_OP_FILL: ggml_op = 71;
pub const ggml_op_GGML_OP_FLASH_ATTN_EXT: ggml_op = 72;
pub const ggml_op_GGML_OP_FLASH_ATTN_BACK: ggml_op = 73;
pub const ggml_op_GGML_OP_SSM_CONV: ggml_op = 74;
pub const ggml_op_GGML_OP_SSM_SCAN: ggml_op = 75;
pub const ggml_op_GGML_OP_WIN_PART: ggml_op = 76;
pub const ggml_op_GGML_OP_WIN_UNPART: ggml_op = 77;
pub const ggml_op_GGML_OP_GET_REL_POS: ggml_op = 78;
pub const ggml_op_GGML_OP_ADD_REL_POS: ggml_op = 79;
pub const ggml_op_GGML_OP_RWKV_WKV6: ggml_op = 80;
pub const ggml_op_GGML_OP_GATED_LINEAR_ATTN: ggml_op = 81;
pub const ggml_op_GGML_OP_RWKV_WKV7: ggml_op = 82;
pub const ggml_op_GGML_OP_SOLVE_TRI: ggml_op = 83;
pub const ggml_op_GGML_OP_UNARY: ggml_op = 84;
pub const ggml_op_GGML_OP_MAP_CUSTOM1: ggml_op = 85;
pub const ggml_op_GGML_OP_MAP_CUSTOM2: ggml_op = 86;
pub const ggml_op_GGML_OP_MAP_CUSTOM3: ggml_op = 87;
pub const ggml_op_GGML_OP_CUSTOM: ggml_op = 88;
pub const ggml_op_GGML_OP_CROSS_ENTROPY_LOSS: ggml_op = 89;
pub const ggml_op_GGML_OP_CROSS_ENTROPY_LOSS_BACK: ggml_op = 90;
pub const ggml_op_GGML_OP_OPT_STEP_ADAMW: ggml_op = 91;
pub const ggml_op_GGML_OP_OPT_STEP_SGD: ggml_op = 92;
pub const ggml_op_GGML_OP_GLU: ggml_op = 93;
pub const ggml_op_GGML_OP_COUNT: ggml_op = 94;
pub type ggml_op = ::std::os::raw::c_int;
pub const ggml_unary_op_GGML_UNARY_OP_ABS: ggml_unary_op = 0;
pub const ggml_unary_op_GGML_UNARY_OP_SGN: ggml_unary_op = 1;
pub const ggml_unary_op_GGML_UNARY_OP_NEG: ggml_unary_op = 2;
pub const ggml_unary_op_GGML_UNARY_OP_STEP: ggml_unary_op = 3;
pub const ggml_unary_op_GGML_UNARY_OP_TANH: ggml_unary_op = 4;
pub const ggml_unary_op_GGML_UNARY_OP_ELU: ggml_unary_op = 5;
pub const ggml_unary_op_GGML_UNARY_OP_RELU: ggml_unary_op = 6;
pub const ggml_unary_op_GGML_UNARY_OP_SIGMOID: ggml_unary_op = 7;
pub const ggml_unary_op_GGML_UNARY_OP_GELU: ggml_unary_op = 8;
pub const ggml_unary_op_GGML_UNARY_OP_GELU_QUICK: ggml_unary_op = 9;
pub const ggml_unary_op_GGML_UNARY_OP_SILU: ggml_unary_op = 10;
pub const ggml_unary_op_GGML_UNARY_OP_HARDSWISH: ggml_unary_op = 11;
pub const ggml_unary_op_GGML_UNARY_OP_HARDSIGMOID: ggml_unary_op = 12;
pub const ggml_unary_op_GGML_UNARY_OP_EXP: ggml_unary_op = 13;
pub const ggml_unary_op_GGML_UNARY_OP_EXPM1: ggml_unary_op = 14;
pub const ggml_unary_op_GGML_UNARY_OP_SOFTPLUS: ggml_unary_op = 15;
pub const ggml_unary_op_GGML_UNARY_OP_GELU_ERF: ggml_unary_op = 16;
pub const ggml_unary_op_GGML_UNARY_OP_XIELU: ggml_unary_op = 17;
pub const ggml_unary_op_GGML_UNARY_OP_FLOOR: ggml_unary_op = 18;
pub const ggml_unary_op_GGML_UNARY_OP_CEIL: ggml_unary_op = 19;
pub const ggml_unary_op_GGML_UNARY_OP_ROUND: ggml_unary_op = 20;
pub const ggml_unary_op_GGML_UNARY_OP_TRUNC: ggml_unary_op = 21;
pub const ggml_unary_op_GGML_UNARY_OP_COUNT: ggml_unary_op = 22;
pub type ggml_unary_op = ::std::os::raw::c_int;
pub const ggml_glu_op_GGML_GLU_OP_REGLU: ggml_glu_op = 0;
pub const ggml_glu_op_GGML_GLU_OP_GEGLU: ggml_glu_op = 1;
pub const ggml_glu_op_GGML_GLU_OP_SWIGLU: ggml_glu_op = 2;
pub const ggml_glu_op_GGML_GLU_OP_SWIGLU_OAI: ggml_glu_op = 3;
pub const ggml_glu_op_GGML_GLU_OP_GEGLU_ERF: ggml_glu_op = 4;
pub const ggml_glu_op_GGML_GLU_OP_GEGLU_QUICK: ggml_glu_op = 5;
pub const ggml_glu_op_GGML_GLU_OP_COUNT: ggml_glu_op = 6;
pub type ggml_glu_op = ::std::os::raw::c_int;
pub const ggml_object_type_GGML_OBJECT_TYPE_TENSOR: ggml_object_type = 0;
pub const ggml_object_type_GGML_OBJECT_TYPE_GRAPH: ggml_object_type = 1;
pub const ggml_object_type_GGML_OBJECT_TYPE_WORK_BUFFER: ggml_object_type = 2;
pub type ggml_object_type = ::std::os::raw::c_int;
pub const ggml_log_level_GGML_LOG_LEVEL_NONE: ggml_log_level = 0;
pub const ggml_log_level_GGML_LOG_LEVEL_DEBUG: ggml_log_level = 1;
pub const ggml_log_level_GGML_LOG_LEVEL_INFO: ggml_log_level = 2;
pub const ggml_log_level_GGML_LOG_LEVEL_WARN: ggml_log_level = 3;
pub const ggml_log_level_GGML_LOG_LEVEL_ERROR: ggml_log_level = 4;
pub const ggml_log_level_GGML_LOG_LEVEL_CONT: ggml_log_level = 5;
pub type ggml_log_level = ::std::os::raw::c_int;
pub const ggml_tensor_flag_GGML_TENSOR_FLAG_INPUT: ggml_tensor_flag = 1;
pub const ggml_tensor_flag_GGML_TENSOR_FLAG_OUTPUT: ggml_tensor_flag = 2;
pub const ggml_tensor_flag_GGML_TENSOR_FLAG_PARAM: ggml_tensor_flag = 4;
pub const ggml_tensor_flag_GGML_TENSOR_FLAG_LOSS: ggml_tensor_flag = 8;
pub type ggml_tensor_flag = ::std::os::raw::c_int;
pub const ggml_tri_type_GGML_TRI_TYPE_UPPER_DIAG: ggml_tri_type = 0;
pub const ggml_tri_type_GGML_TRI_TYPE_UPPER: ggml_tri_type = 1;
pub const ggml_tri_type_GGML_TRI_TYPE_LOWER_DIAG: ggml_tri_type = 2;
pub const ggml_tri_type_GGML_TRI_TYPE_LOWER: ggml_tri_type = 3;
pub type ggml_tri_type = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_init_params {
  pub mem_size: usize,
  pub mem_buffer: *mut ::std::os::raw::c_void,
  pub no_alloc: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ggml_init_params"][::std::mem::size_of::<ggml_init_params>() - 24usize];
  ["Alignment of ggml_init_params"][::std::mem::align_of::<ggml_init_params>() - 8usize];
  ["Offset of field: ggml_init_params::mem_size"]
    [::std::mem::offset_of!(ggml_init_params, mem_size) - 0usize];
  ["Offset of field: ggml_init_params::mem_buffer"]
    [::std::mem::offset_of!(ggml_init_params, mem_buffer) - 8usize];
  ["Offset of field: ggml_init_params::no_alloc"]
    [::std::mem::offset_of!(ggml_init_params, no_alloc) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_tensor {
  pub type_: ggml_type,
  pub buffer: *mut ggml_backend_buffer,
  pub ne: [i64; 4usize],
  pub nb: [usize; 4usize],
  pub op: ggml_op,
  pub op_params: [i32; 16usize],
  pub flags: i32,
  pub src: [*mut ggml_tensor; 10usize],
  pub view_src: *mut ggml_tensor,
  pub view_offs: usize,
  pub data: *mut ::std::os::raw::c_void,
  pub name: [::std::os::raw::c_char; 64usize],
  pub extra: *mut ::std::os::raw::c_void,
  pub padding: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ggml_tensor"][::std::mem::size_of::<ggml_tensor>() - 336usize];
  ["Alignment of ggml_tensor"][::std::mem::align_of::<ggml_tensor>() - 8usize];
  ["Offset of field: ggml_tensor::type_"][::std::mem::offset_of!(ggml_tensor, type_) - 0usize];
  ["Offset of field: ggml_tensor::buffer"][::std::mem::offset_of!(ggml_tensor, buffer) - 8usize];
  ["Offset of field: ggml_tensor::ne"][::std::mem::offset_of!(ggml_tensor, ne) - 16usize];
  ["Offset of field: ggml_tensor::nb"][::std::mem::offset_of!(ggml_tensor, nb) - 48usize];
  ["Offset of field: ggml_tensor::op"][::std::mem::offset_of!(ggml_tensor, op) - 80usize];
  ["Offset of field: ggml_tensor::op_params"]
    [::std::mem::offset_of!(ggml_tensor, op_params) - 84usize];
  ["Offset of field: ggml_tensor::flags"][::std::mem::offset_of!(ggml_tensor, flags) - 148usize];
  ["Offset of field: ggml_tensor::src"][::std::mem::offset_of!(ggml_tensor, src) - 152usize];
  ["Offset of field: ggml_tensor::view_src"]
    [::std::mem::offset_of!(ggml_tensor, view_src) - 232usize];
  ["Offset of field: ggml_tensor::view_offs"]
    [::std::mem::offset_of!(ggml_tensor, view_offs) - 240usize];
  ["Offset of field: ggml_tensor::data"][::std::mem::offset_of!(ggml_tensor, data) - 248usize];
  ["Offset of field: ggml_tensor::name"][::std::mem::offset_of!(ggml_tensor, name) - 256usize];
  ["Offset of field: ggml_tensor::extra"][::std::mem::offset_of!(ggml_tensor, extra) - 320usize];
  ["Offset of field: ggml_tensor::padding"]
    [::std::mem::offset_of!(ggml_tensor, padding) - 328usize];
};
pub const GGML_TENSOR_SIZE: usize = 336;
pub type ggml_abort_callback =
  ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> bool>;
pub type ggml_guid = [u8; 16usize];
pub type ggml_guid_t = *mut ggml_guid;
pub const ggml_op_pool_GGML_OP_POOL_MAX: ggml_op_pool = 0;
pub const ggml_op_pool_GGML_OP_POOL_AVG: ggml_op_pool = 1;
pub const ggml_op_pool_GGML_OP_POOL_COUNT: ggml_op_pool = 2;
pub type ggml_op_pool = ::std::os::raw::c_int;
pub const ggml_scale_mode_GGML_SCALE_MODE_NEAREST: ggml_scale_mode = 0;
pub const ggml_scale_mode_GGML_SCALE_MODE_BILINEAR: ggml_scale_mode = 1;
pub const ggml_scale_mode_GGML_SCALE_MODE_BICUBIC: ggml_scale_mode = 2;
pub const ggml_scale_mode_GGML_SCALE_MODE_COUNT: ggml_scale_mode = 3;
pub type ggml_scale_mode = ::std::os::raw::c_int;
pub const ggml_scale_flag_GGML_SCALE_FLAG_ALIGN_CORNERS: ggml_scale_flag = 256;
pub type ggml_scale_flag = ::std::os::raw::c_int;
pub const ggml_sort_order_GGML_SORT_ORDER_ASC: ggml_sort_order = 0;
pub const ggml_sort_order_GGML_SORT_ORDER_DESC: ggml_sort_order = 1;
pub type ggml_sort_order = ::std::os::raw::c_int;
pub type ggml_custom1_op_t = ::std::option::Option<
  unsafe extern "C" fn(
    dst: *mut ggml_tensor,
    a: *const ggml_tensor,
    ith: ::std::os::raw::c_int,
    nth: ::std::os::raw::c_int,
    userdata: *mut ::std::os::raw::c_void,
  ),
>;
pub type ggml_custom2_op_t = ::std::option::Option<
  unsafe extern "C" fn(
    dst: *mut ggml_tensor,
    a: *const ggml_tensor,
    b: *const ggml_tensor,
    ith: ::std::os::raw::c_int,
    nth: ::std::os::raw::c_int,
    userdata: *mut ::std::os::raw::c_void,
  ),
>;
pub type ggml_custom3_op_t = ::std::option::Option<
  unsafe extern "C" fn(
    dst: *mut ggml_tensor,
    a: *const ggml_tensor,
    b: *const ggml_tensor,
    c: *const ggml_tensor,
    ith: ::std::os::raw::c_int,
    nth: ::std::os::raw::c_int,
    userdata: *mut ::std::os::raw::c_void,
  ),
>;
pub type ggml_custom_op_t = ::std::option::Option<
  unsafe extern "C" fn(
    dst: *mut ggml_tensor,
    ith: ::std::os::raw::c_int,
    nth: ::std::os::raw::c_int,
    userdata: *mut ::std::os::raw::c_void,
  ),
>;
pub type ggml_log_callback = ::std::option::Option<
  unsafe extern "C" fn(
    level: ggml_log_level,
    text: *const ::std::os::raw::c_char,
    user_data: *mut ::std::os::raw::c_void,
  ),
>;
pub type ggml_to_float_t = ::std::option::Option<
  unsafe extern "C" fn(x: *const ::std::os::raw::c_void, y: *mut f32, k: i64),
>;
pub type ggml_from_float_t = ::std::option::Option<
  unsafe extern "C" fn(x: *const f32, y: *mut ::std::os::raw::c_void, k: i64),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_type_traits {
  pub type_name: *const ::std::os::raw::c_char,
  pub blck_size: i64,
  pub blck_size_interleave: i64,
  pub type_size: usize,
  pub is_quantized: bool,
  pub to_float: ggml_to_float_t,
  pub from_float_ref: ggml_from_float_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ggml_type_traits"][::std::mem::size_of::<ggml_type_traits>() - 56usize];
  ["Alignment of ggml_type_traits"][::std::mem::align_of::<ggml_type_traits>() - 8usize];
  ["Offset of field: ggml_type_traits::type_name"]
    [::std::mem::offset_of!(ggml_type_traits, type_name) - 0usize];
  ["Offset of field: ggml_type_traits::blck_size"]
    [::std::mem::offset_of!(ggml_type_traits, blck_size) - 8usize];
  ["Offset of field: ggml_type_traits::blck_size_interleave"]
    [::std::mem::offset_of!(ggml_type_traits, blck_size_interleave) - 16usize];
  ["Offset of field: ggml_type_traits::type_size"]
    [::std::mem::offset_of!(ggml_type_traits, type_size) - 24usize];
  ["Offset of field: ggml_type_traits::is_quantized"]
    [::std::mem::offset_of!(ggml_type_traits, is_quantized) - 32usize];
  ["Offset of field: ggml_type_traits::to_float"]
    [::std::mem::offset_of!(ggml_type_traits, to_float) - 40usize];
  ["Offset of field: ggml_type_traits::from_float_ref"]
    [::std::mem::offset_of!(ggml_type_traits, from_float_ref) - 48usize];
};
pub const ggml_sched_priority_GGML_SCHED_PRIO_LOW: ggml_sched_priority = -1;
pub const ggml_sched_priority_GGML_SCHED_PRIO_NORMAL: ggml_sched_priority = 0;
pub const ggml_sched_priority_GGML_SCHED_PRIO_MEDIUM: ggml_sched_priority = 1;
pub const ggml_sched_priority_GGML_SCHED_PRIO_HIGH: ggml_sched_priority = 2;
pub const ggml_sched_priority_GGML_SCHED_PRIO_REALTIME: ggml_sched_priority = 3;
pub type ggml_sched_priority = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_threadpool_params {
  pub cpumask: [bool; 512usize],
  pub n_threads: ::std::os::raw::c_int,
  pub prio: ggml_sched_priority,
  pub poll: u32,
  pub strict_cpu: bool,
  pub paused: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ggml_threadpool_params"][::std::mem::size_of::<ggml_threadpool_params>() - 528usize];
  ["Alignment of ggml_threadpool_params"]
    [::std::mem::align_of::<ggml_threadpool_params>() - 4usize];
  ["Offset of field: ggml_threadpool_params::cpumask"]
    [::std::mem::offset_of!(ggml_threadpool_params, cpumask) - 0usize];
  ["Offset of field: ggml_threadpool_params::n_threads"]
    [::std::mem::offset_of!(ggml_threadpool_params, n_threads) - 512usize];
  ["Offset of field: ggml_threadpool_params::prio"]
    [::std::mem::offset_of!(ggml_threadpool_params, prio) - 516usize];
  ["Offset of field: ggml_threadpool_params::poll"]
    [::std::mem::offset_of!(ggml_threadpool_params, poll) - 520usize];
  ["Offset of field: ggml_threadpool_params::strict_cpu"]
    [::std::mem::offset_of!(ggml_threadpool_params, strict_cpu) - 524usize];
  ["Offset of field: ggml_threadpool_params::paused"]
    [::std::mem::offset_of!(ggml_threadpool_params, paused) - 525usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_threadpool {
  _unused: [u8; 0],
}
pub type ggml_threadpool_t = *mut ggml_threadpool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_backend_buffer_type {
  _unused: [u8; 0],
}
pub type ggml_backend_buffer_type_t = *mut ggml_backend_buffer_type;
pub type ggml_backend_buffer_t = *mut ggml_backend_buffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_backend {
  _unused: [u8; 0],
}
pub type ggml_backend_t = *mut ggml_backend;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_tallocr {
  pub buffer: ggml_backend_buffer_t,
  pub base: *mut ::std::os::raw::c_void,
  pub alignment: usize,
  pub offset: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ggml_tallocr"][::std::mem::size_of::<ggml_tallocr>() - 32usize];
  ["Alignment of ggml_tallocr"][::std::mem::align_of::<ggml_tallocr>() - 8usize];
  ["Offset of field: ggml_tallocr::buffer"][::std::mem::offset_of!(ggml_tallocr, buffer) - 0usize];
  ["Offset of field: ggml_tallocr::base"][::std::mem::offset_of!(ggml_tallocr, base) - 8usize];
  ["Offset of field: ggml_tallocr::alignment"]
    [::std::mem::offset_of!(ggml_tallocr, alignment) - 16usize];
  ["Offset of field: ggml_tallocr::offset"][::std::mem::offset_of!(ggml_tallocr, offset) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_gallocr {
  _unused: [u8; 0],
}
pub type ggml_gallocr_t = *mut ggml_gallocr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_backend_event {
  _unused: [u8; 0],
}
pub type ggml_backend_event_t = *mut ggml_backend_event;
pub type ggml_backend_graph_plan_t = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_backend_reg {
  _unused: [u8; 0],
}
pub type ggml_backend_reg_t = *mut ggml_backend_reg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_backend_device {
  _unused: [u8; 0],
}
pub type ggml_backend_dev_t = *mut ggml_backend_device;
pub const ggml_backend_buffer_usage_GGML_BACKEND_BUFFER_USAGE_ANY: ggml_backend_buffer_usage = 0;
pub const ggml_backend_buffer_usage_GGML_BACKEND_BUFFER_USAGE_WEIGHTS: ggml_backend_buffer_usage =
  1;
pub const ggml_backend_buffer_usage_GGML_BACKEND_BUFFER_USAGE_COMPUTE: ggml_backend_buffer_usage =
  2;
pub type ggml_backend_buffer_usage = ::std::os::raw::c_int;
pub const ggml_backend_dev_type_GGML_BACKEND_DEVICE_TYPE_CPU: ggml_backend_dev_type = 0;
pub const ggml_backend_dev_type_GGML_BACKEND_DEVICE_TYPE_GPU: ggml_backend_dev_type = 1;
pub const ggml_backend_dev_type_GGML_BACKEND_DEVICE_TYPE_IGPU: ggml_backend_dev_type = 2;
pub const ggml_backend_dev_type_GGML_BACKEND_DEVICE_TYPE_ACCEL: ggml_backend_dev_type = 3;
pub type ggml_backend_dev_type = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_backend_dev_caps {
  pub async_: bool,
  pub host_buffer: bool,
  pub buffer_from_host_ptr: bool,
  pub events: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ggml_backend_dev_caps"][::std::mem::size_of::<ggml_backend_dev_caps>() - 4usize];
  ["Alignment of ggml_backend_dev_caps"][::std::mem::align_of::<ggml_backend_dev_caps>() - 1usize];
  ["Offset of field: ggml_backend_dev_caps::async_"]
    [::std::mem::offset_of!(ggml_backend_dev_caps, async_) - 0usize];
  ["Offset of field: ggml_backend_dev_caps::host_buffer"]
    [::std::mem::offset_of!(ggml_backend_dev_caps, host_buffer) - 1usize];
  ["Offset of field: ggml_backend_dev_caps::buffer_from_host_ptr"]
    [::std::mem::offset_of!(ggml_backend_dev_caps, buffer_from_host_ptr) - 2usize];
  ["Offset of field: ggml_backend_dev_caps::events"]
    [::std::mem::offset_of!(ggml_backend_dev_caps, events) - 3usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_backend_dev_props {
  pub name: *const ::std::os::raw::c_char,
  pub description: *const ::std::os::raw::c_char,
  pub memory_free: usize,
  pub memory_total: usize,
  pub type_: ggml_backend_dev_type,
  pub device_id: *const ::std::os::raw::c_char,
  pub caps: ggml_backend_dev_caps,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ggml_backend_dev_props"][::std::mem::size_of::<ggml_backend_dev_props>() - 56usize];
  ["Alignment of ggml_backend_dev_props"]
    [::std::mem::align_of::<ggml_backend_dev_props>() - 8usize];
  ["Offset of field: ggml_backend_dev_props::name"]
    [::std::mem::offset_of!(ggml_backend_dev_props, name) - 0usize];
  ["Offset of field: ggml_backend_dev_props::description"]
    [::std::mem::offset_of!(ggml_backend_dev_props, description) - 8usize];
  ["Offset of field: ggml_backend_dev_props::memory_free"]
    [::std::mem::offset_of!(ggml_backend_dev_props, memory_free) - 16usize];
  ["Offset of field: ggml_backend_dev_props::memory_total"]
    [::std::mem::offset_of!(ggml_backend_dev_props, memory_total) - 24usize];
  ["Offset of field: ggml_backend_dev_props::type_"]
    [::std::mem::offset_of!(ggml_backend_dev_props, type_) - 32usize];
  ["Offset of field: ggml_backend_dev_props::device_id"]
    [::std::mem::offset_of!(ggml_backend_dev_props, device_id) - 40usize];
  ["Offset of field: ggml_backend_dev_props::caps"]
    [::std::mem::offset_of!(ggml_backend_dev_props, caps) - 48usize];
};
pub type ggml_backend_split_buffer_type_t = ::std::option::Option<
  unsafe extern "C" fn(
    main_device: ::std::os::raw::c_int,
    tensor_split: *const f32,
  ) -> ggml_backend_buffer_type_t,
>;
pub type ggml_backend_set_n_threads_t = ::std::option::Option<
  unsafe extern "C" fn(backend: ggml_backend_t, n_threads: ::std::os::raw::c_int),
>;
pub type ggml_backend_dev_get_extra_bufts_t = ::std::option::Option<
  unsafe extern "C" fn(device: ggml_backend_dev_t) -> *mut ggml_backend_buffer_type_t,
>;
pub type ggml_backend_set_abort_callback_t = ::std::option::Option<
  unsafe extern "C" fn(
    backend: ggml_backend_t,
    abort_callback: ggml_abort_callback,
    abort_callback_data: *mut ::std::os::raw::c_void,
  ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_backend_feature {
  pub name: *const ::std::os::raw::c_char,
  pub value: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ggml_backend_feature"][::std::mem::size_of::<ggml_backend_feature>() - 16usize];
  ["Alignment of ggml_backend_feature"][::std::mem::align_of::<ggml_backend_feature>() - 8usize];
  ["Offset of field: ggml_backend_feature::name"]
    [::std::mem::offset_of!(ggml_backend_feature, name) - 0usize];
  ["Offset of field: ggml_backend_feature::value"]
    [::std::mem::offset_of!(ggml_backend_feature, value) - 8usize];
};
pub type ggml_backend_get_features_t =
  ::std::option::Option<unsafe extern "C" fn(reg: ggml_backend_reg_t) -> *mut ggml_backend_feature>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_backend_sched {
  _unused: [u8; 0],
}
pub type ggml_backend_sched_t = *mut ggml_backend_sched;
pub type ggml_backend_sched_eval_callback = ::std::option::Option<
  unsafe extern "C" fn(
    t: *mut ggml_tensor,
    ask: bool,
    user_data: *mut ::std::os::raw::c_void,
  ) -> bool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_backend_graph_copy {
  pub buffer: ggml_backend_buffer_t,
  pub ctx_allocated: *mut ggml_context,
  pub ctx_unallocated: *mut ggml_context,
  pub graph: *mut ggml_cgraph,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ggml_backend_graph_copy"][::std::mem::size_of::<ggml_backend_graph_copy>() - 32usize];
  ["Alignment of ggml_backend_graph_copy"]
    [::std::mem::align_of::<ggml_backend_graph_copy>() - 8usize];
  ["Offset of field: ggml_backend_graph_copy::buffer"]
    [::std::mem::offset_of!(ggml_backend_graph_copy, buffer) - 0usize];
  ["Offset of field: ggml_backend_graph_copy::ctx_allocated"]
    [::std::mem::offset_of!(ggml_backend_graph_copy, ctx_allocated) - 8usize];
  ["Offset of field: ggml_backend_graph_copy::ctx_unallocated"]
    [::std::mem::offset_of!(ggml_backend_graph_copy, ctx_unallocated) - 16usize];
  ["Offset of field: ggml_backend_graph_copy::graph"]
    [::std::mem::offset_of!(ggml_backend_graph_copy, graph) - 24usize];
};
pub type ggml_backend_eval_callback = ::std::option::Option<
  unsafe extern "C" fn(
    node_index: ::std::os::raw::c_int,
    t1: *mut ggml_tensor,
    t2: *mut ggml_tensor,
    user_data: *mut ::std::os::raw::c_void,
  ) -> bool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_cplan {
  pub work_size: usize,
  pub work_data: *mut u8,
  pub n_threads: ::std::os::raw::c_int,
  pub threadpool: *mut ggml_threadpool,
  pub abort_callback: ggml_abort_callback,
  pub abort_callback_data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ggml_cplan"][::std::mem::size_of::<ggml_cplan>() - 48usize];
  ["Alignment of ggml_cplan"][::std::mem::align_of::<ggml_cplan>() - 8usize];
  ["Offset of field: ggml_cplan::work_size"]
    [::std::mem::offset_of!(ggml_cplan, work_size) - 0usize];
  ["Offset of field: ggml_cplan::work_data"]
    [::std::mem::offset_of!(ggml_cplan, work_data) - 8usize];
  ["Offset of field: ggml_cplan::n_threads"]
    [::std::mem::offset_of!(ggml_cplan, n_threads) - 16usize];
  ["Offset of field: ggml_cplan::threadpool"]
    [::std::mem::offset_of!(ggml_cplan, threadpool) - 24usize];
  ["Offset of field: ggml_cplan::abort_callback"]
    [::std::mem::offset_of!(ggml_cplan, abort_callback) - 32usize];
  ["Offset of field: ggml_cplan::abort_callback_data"]
    [::std::mem::offset_of!(ggml_cplan, abort_callback_data) - 40usize];
};
pub const ggml_numa_strategy_GGML_NUMA_STRATEGY_DISABLED: ggml_numa_strategy = 0;
pub const ggml_numa_strategy_GGML_NUMA_STRATEGY_DISTRIBUTE: ggml_numa_strategy = 1;
pub const ggml_numa_strategy_GGML_NUMA_STRATEGY_ISOLATE: ggml_numa_strategy = 2;
pub const ggml_numa_strategy_GGML_NUMA_STRATEGY_NUMACTL: ggml_numa_strategy = 3;
pub const ggml_numa_strategy_GGML_NUMA_STRATEGY_MIRROR: ggml_numa_strategy = 4;
pub const ggml_numa_strategy_GGML_NUMA_STRATEGY_COUNT: ggml_numa_strategy = 5;
pub type ggml_numa_strategy = ::std::os::raw::c_int;
pub type ggml_vec_dot_t = ::std::option::Option<
  unsafe extern "C" fn(
    n: ::std::os::raw::c_int,
    s: *mut f32,
    bs: usize,
    x: *const ::std::os::raw::c_void,
    bx: usize,
    y: *const ::std::os::raw::c_void,
    by: usize,
    nrc: ::std::os::raw::c_int,
  ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_type_traits_cpu {
  pub from_float: ggml_from_float_t,
  pub vec_dot: ggml_vec_dot_t,
  pub vec_dot_type: ggml_type,
  pub nrows: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ggml_type_traits_cpu"][::std::mem::size_of::<ggml_type_traits_cpu>() - 32usize];
  ["Alignment of ggml_type_traits_cpu"][::std::mem::align_of::<ggml_type_traits_cpu>() - 8usize];
  ["Offset of field: ggml_type_traits_cpu::from_float"]
    [::std::mem::offset_of!(ggml_type_traits_cpu, from_float) - 0usize];
  ["Offset of field: ggml_type_traits_cpu::vec_dot"]
    [::std::mem::offset_of!(ggml_type_traits_cpu, vec_dot) - 8usize];
  ["Offset of field: ggml_type_traits_cpu::vec_dot_type"]
    [::std::mem::offset_of!(ggml_type_traits_cpu, vec_dot_type) - 16usize];
  ["Offset of field: ggml_type_traits_cpu::nrows"]
    [::std::mem::offset_of!(ggml_type_traits_cpu, nrows) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_context {
  _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_state {
  _unused: [u8; 0],
}
pub type whisper_pos = i32;
pub type whisper_token = i32;
pub type whisper_seq_id = i32;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_NONE: whisper_alignment_heads_preset = 0;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_N_TOP_MOST: whisper_alignment_heads_preset =
  1;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_CUSTOM: whisper_alignment_heads_preset = 2;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_TINY_EN: whisper_alignment_heads_preset = 3;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_TINY: whisper_alignment_heads_preset = 4;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_BASE_EN: whisper_alignment_heads_preset = 5;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_BASE: whisper_alignment_heads_preset = 6;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_SMALL_EN: whisper_alignment_heads_preset =
  7;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_SMALL: whisper_alignment_heads_preset = 8;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_MEDIUM_EN: whisper_alignment_heads_preset =
  9;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_MEDIUM: whisper_alignment_heads_preset = 10;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_LARGE_V1: whisper_alignment_heads_preset =
  11;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_LARGE_V2: whisper_alignment_heads_preset =
  12;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_LARGE_V3: whisper_alignment_heads_preset =
  13;
pub const whisper_alignment_heads_preset_WHISPER_AHEADS_LARGE_V3_TURBO:
  whisper_alignment_heads_preset = 14;
pub type whisper_alignment_heads_preset = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_ahead {
  pub n_text_layer: ::std::os::raw::c_int,
  pub n_head: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of whisper_ahead"][::std::mem::size_of::<whisper_ahead>() - 8usize];
  ["Alignment of whisper_ahead"][::std::mem::align_of::<whisper_ahead>() - 4usize];
  ["Offset of field: whisper_ahead::n_text_layer"]
    [::std::mem::offset_of!(whisper_ahead, n_text_layer) - 0usize];
  ["Offset of field: whisper_ahead::n_head"]
    [::std::mem::offset_of!(whisper_ahead, n_head) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_aheads {
  pub n_heads: usize,
  pub heads: *const whisper_ahead,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of whisper_aheads"][::std::mem::size_of::<whisper_aheads>() - 16usize];
  ["Alignment of whisper_aheads"][::std::mem::align_of::<whisper_aheads>() - 8usize];
  ["Offset of field: whisper_aheads::n_heads"]
    [::std::mem::offset_of!(whisper_aheads, n_heads) - 0usize];
  ["Offset of field: whisper_aheads::heads"]
    [::std::mem::offset_of!(whisper_aheads, heads) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_context_params {
  pub use_gpu: bool,
  pub flash_attn: bool,
  pub gpu_device: ::std::os::raw::c_int,
  pub dtw_token_timestamps: bool,
  pub dtw_aheads_preset: whisper_alignment_heads_preset,
  pub dtw_n_top: ::std::os::raw::c_int,
  pub dtw_aheads: whisper_aheads,
  pub dtw_mem_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of whisper_context_params"][::std::mem::size_of::<whisper_context_params>() - 48usize];
  ["Alignment of whisper_context_params"]
    [::std::mem::align_of::<whisper_context_params>() - 8usize];
  ["Offset of field: whisper_context_params::use_gpu"]
    [::std::mem::offset_of!(whisper_context_params, use_gpu) - 0usize];
  ["Offset of field: whisper_context_params::flash_attn"]
    [::std::mem::offset_of!(whisper_context_params, flash_attn) - 1usize];
  ["Offset of field: whisper_context_params::gpu_device"]
    [::std::mem::offset_of!(whisper_context_params, gpu_device) - 4usize];
  ["Offset of field: whisper_context_params::dtw_token_timestamps"]
    [::std::mem::offset_of!(whisper_context_params, dtw_token_timestamps) - 8usize];
  ["Offset of field: whisper_context_params::dtw_aheads_preset"]
    [::std::mem::offset_of!(whisper_context_params, dtw_aheads_preset) - 12usize];
  ["Offset of field: whisper_context_params::dtw_n_top"]
    [::std::mem::offset_of!(whisper_context_params, dtw_n_top) - 16usize];
  ["Offset of field: whisper_context_params::dtw_aheads"]
    [::std::mem::offset_of!(whisper_context_params, dtw_aheads) - 24usize];
  ["Offset of field: whisper_context_params::dtw_mem_size"]
    [::std::mem::offset_of!(whisper_context_params, dtw_mem_size) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_token_data {
  pub id: whisper_token,
  pub tid: whisper_token,
  pub p: f32,
  pub plog: f32,
  pub pt: f32,
  pub ptsum: f32,
  pub t0: i64,
  pub t1: i64,
  pub t_dtw: i64,
  pub vlen: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of whisper_token_data"][::std::mem::size_of::<whisper_token_data>() - 56usize];
  ["Alignment of whisper_token_data"][::std::mem::align_of::<whisper_token_data>() - 8usize];
  ["Offset of field: whisper_token_data::id"]
    [::std::mem::offset_of!(whisper_token_data, id) - 0usize];
  ["Offset of field: whisper_token_data::tid"]
    [::std::mem::offset_of!(whisper_token_data, tid) - 4usize];
  ["Offset of field: whisper_token_data::p"]
    [::std::mem::offset_of!(whisper_token_data, p) - 8usize];
  ["Offset of field: whisper_token_data::plog"]
    [::std::mem::offset_of!(whisper_token_data, plog) - 12usize];
  ["Offset of field: whisper_token_data::pt"]
    [::std::mem::offset_of!(whisper_token_data, pt) - 16usize];
  ["Offset of field: whisper_token_data::ptsum"]
    [::std::mem::offset_of!(whisper_token_data, ptsum) - 20usize];
  ["Offset of field: whisper_token_data::t0"]
    [::std::mem::offset_of!(whisper_token_data, t0) - 24usize];
  ["Offset of field: whisper_token_data::t1"]
    [::std::mem::offset_of!(whisper_token_data, t1) - 32usize];
  ["Offset of field: whisper_token_data::t_dtw"]
    [::std::mem::offset_of!(whisper_token_data, t_dtw) - 40usize];
  ["Offset of field: whisper_token_data::vlen"]
    [::std::mem::offset_of!(whisper_token_data, vlen) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_model_loader {
  pub context: *mut ::std::os::raw::c_void,
  pub read: ::std::option::Option<
    unsafe extern "C" fn(
      ctx: *mut ::std::os::raw::c_void,
      output: *mut ::std::os::raw::c_void,
      read_size: usize,
    ) -> usize,
  >,
  pub eof: ::std::option::Option<unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void) -> bool>,
  pub close: ::std::option::Option<unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of whisper_model_loader"][::std::mem::size_of::<whisper_model_loader>() - 32usize];
  ["Alignment of whisper_model_loader"][::std::mem::align_of::<whisper_model_loader>() - 8usize];
  ["Offset of field: whisper_model_loader::context"]
    [::std::mem::offset_of!(whisper_model_loader, context) - 0usize];
  ["Offset of field: whisper_model_loader::read"]
    [::std::mem::offset_of!(whisper_model_loader, read) - 8usize];
  ["Offset of field: whisper_model_loader::eof"]
    [::std::mem::offset_of!(whisper_model_loader, eof) - 16usize];
  ["Offset of field: whisper_model_loader::close"]
    [::std::mem::offset_of!(whisper_model_loader, close) - 24usize];
};
pub const whisper_gretype_WHISPER_GRETYPE_END: whisper_gretype = 0;
pub const whisper_gretype_WHISPER_GRETYPE_ALT: whisper_gretype = 1;
pub const whisper_gretype_WHISPER_GRETYPE_RULE_REF: whisper_gretype = 2;
pub const whisper_gretype_WHISPER_GRETYPE_CHAR: whisper_gretype = 3;
pub const whisper_gretype_WHISPER_GRETYPE_CHAR_NOT: whisper_gretype = 4;
pub const whisper_gretype_WHISPER_GRETYPE_CHAR_RNG_UPPER: whisper_gretype = 5;
pub const whisper_gretype_WHISPER_GRETYPE_CHAR_ALT: whisper_gretype = 6;
pub type whisper_gretype = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_grammar_element {
  pub type_: whisper_gretype,
  pub value: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of whisper_grammar_element"][::std::mem::size_of::<whisper_grammar_element>() - 8usize];
  ["Alignment of whisper_grammar_element"]
    [::std::mem::align_of::<whisper_grammar_element>() - 4usize];
  ["Offset of field: whisper_grammar_element::type_"]
    [::std::mem::offset_of!(whisper_grammar_element, type_) - 0usize];
  ["Offset of field: whisper_grammar_element::value"]
    [::std::mem::offset_of!(whisper_grammar_element, value) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_vad_params {
  pub threshold: f32,
  pub min_speech_duration_ms: ::std::os::raw::c_int,
  pub min_silence_duration_ms: ::std::os::raw::c_int,
  pub max_speech_duration_s: f32,
  pub speech_pad_ms: ::std::os::raw::c_int,
  pub samples_overlap: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of whisper_vad_params"][::std::mem::size_of::<whisper_vad_params>() - 24usize];
  ["Alignment of whisper_vad_params"][::std::mem::align_of::<whisper_vad_params>() - 4usize];
  ["Offset of field: whisper_vad_params::threshold"]
    [::std::mem::offset_of!(whisper_vad_params, threshold) - 0usize];
  ["Offset of field: whisper_vad_params::min_speech_duration_ms"]
    [::std::mem::offset_of!(whisper_vad_params, min_speech_duration_ms) - 4usize];
  ["Offset of field: whisper_vad_params::min_silence_duration_ms"]
    [::std::mem::offset_of!(whisper_vad_params, min_silence_duration_ms) - 8usize];
  ["Offset of field: whisper_vad_params::max_speech_duration_s"]
    [::std::mem::offset_of!(whisper_vad_params, max_speech_duration_s) - 12usize];
  ["Offset of field: whisper_vad_params::speech_pad_ms"]
    [::std::mem::offset_of!(whisper_vad_params, speech_pad_ms) - 16usize];
  ["Offset of field: whisper_vad_params::samples_overlap"]
    [::std::mem::offset_of!(whisper_vad_params, samples_overlap) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_timings {
  pub sample_ms: f32,
  pub encode_ms: f32,
  pub decode_ms: f32,
  pub batchd_ms: f32,
  pub prompt_ms: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of whisper_timings"][::std::mem::size_of::<whisper_timings>() - 20usize];
  ["Alignment of whisper_timings"][::std::mem::align_of::<whisper_timings>() - 4usize];
  ["Offset of field: whisper_timings::sample_ms"]
    [::std::mem::offset_of!(whisper_timings, sample_ms) - 0usize];
  ["Offset of field: whisper_timings::encode_ms"]
    [::std::mem::offset_of!(whisper_timings, encode_ms) - 4usize];
  ["Offset of field: whisper_timings::decode_ms"]
    [::std::mem::offset_of!(whisper_timings, decode_ms) - 8usize];
  ["Offset of field: whisper_timings::batchd_ms"]
    [::std::mem::offset_of!(whisper_timings, batchd_ms) - 12usize];
  ["Offset of field: whisper_timings::prompt_ms"]
    [::std::mem::offset_of!(whisper_timings, prompt_ms) - 16usize];
};
pub const whisper_sampling_strategy_WHISPER_SAMPLING_GREEDY: whisper_sampling_strategy = 0;
pub const whisper_sampling_strategy_WHISPER_SAMPLING_BEAM_SEARCH: whisper_sampling_strategy = 1;
pub type whisper_sampling_strategy = ::std::os::raw::c_int;
pub type whisper_new_segment_callback = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut whisper_context,
    state: *mut whisper_state,
    n_new: ::std::os::raw::c_int,
    user_data: *mut ::std::os::raw::c_void,
  ),
>;
pub type whisper_progress_callback = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut whisper_context,
    state: *mut whisper_state,
    progress: ::std::os::raw::c_int,
    user_data: *mut ::std::os::raw::c_void,
  ),
>;
pub type whisper_encoder_begin_callback = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut whisper_context,
    state: *mut whisper_state,
    user_data: *mut ::std::os::raw::c_void,
  ) -> bool,
>;
pub type whisper_logits_filter_callback = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut whisper_context,
    state: *mut whisper_state,
    tokens: *const whisper_token_data,
    n_tokens: ::std::os::raw::c_int,
    logits: *mut f32,
    user_data: *mut ::std::os::raw::c_void,
  ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_full_params {
  pub strategy: whisper_sampling_strategy,
  pub n_threads: ::std::os::raw::c_int,
  pub n_max_text_ctx: ::std::os::raw::c_int,
  pub offset_ms: ::std::os::raw::c_int,
  pub duration_ms: ::std::os::raw::c_int,
  pub translate: bool,
  pub no_context: bool,
  pub no_timestamps: bool,
  pub single_segment: bool,
  pub print_special: bool,
  pub print_progress: bool,
  pub print_realtime: bool,
  pub print_timestamps: bool,
  pub token_timestamps: bool,
  pub thold_pt: f32,
  pub thold_ptsum: f32,
  pub max_len: ::std::os::raw::c_int,
  pub split_on_word: bool,
  pub max_tokens: ::std::os::raw::c_int,
  pub debug_mode: bool,
  pub audio_ctx: ::std::os::raw::c_int,
  pub tdrz_enable: bool,
  pub suppress_regex: *const ::std::os::raw::c_char,
  pub initial_prompt: *const ::std::os::raw::c_char,
  pub carry_initial_prompt: bool,
  pub prompt_tokens: *const whisper_token,
  pub prompt_n_tokens: ::std::os::raw::c_int,
  pub language: *const ::std::os::raw::c_char,
  pub detect_language: bool,
  pub suppress_blank: bool,
  pub suppress_nst: bool,
  pub temperature: f32,
  pub max_initial_ts: f32,
  pub length_penalty: f32,
  pub temperature_inc: f32,
  pub entropy_thold: f32,
  pub logprob_thold: f32,
  pub no_speech_thold: f32,
  pub greedy: whisper_full_params__bindgen_ty_1,
  pub beam_search: whisper_full_params__bindgen_ty_2,
  pub new_segment_callback: whisper_new_segment_callback,
  pub new_segment_callback_user_data: *mut ::std::os::raw::c_void,
  pub progress_callback: whisper_progress_callback,
  pub progress_callback_user_data: *mut ::std::os::raw::c_void,
  pub encoder_begin_callback: whisper_encoder_begin_callback,
  pub encoder_begin_callback_user_data: *mut ::std::os::raw::c_void,
  pub abort_callback: ggml_abort_callback,
  pub abort_callback_user_data: *mut ::std::os::raw::c_void,
  pub logits_filter_callback: whisper_logits_filter_callback,
  pub logits_filter_callback_user_data: *mut ::std::os::raw::c_void,
  pub grammar_rules: *mut *const whisper_grammar_element,
  pub n_grammar_rules: usize,
  pub i_start_rule: usize,
  pub grammar_penalty: f32,
  pub vad: bool,
  pub vad_model_path: *const ::std::os::raw::c_char,
  pub vad_params: whisper_vad_params,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_full_params__bindgen_ty_1 {
  pub best_of: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of whisper_full_params__bindgen_ty_1"]
    [::std::mem::size_of::<whisper_full_params__bindgen_ty_1>() - 4usize];
  ["Alignment of whisper_full_params__bindgen_ty_1"]
    [::std::mem::align_of::<whisper_full_params__bindgen_ty_1>() - 4usize];
  ["Offset of field: whisper_full_params__bindgen_ty_1::best_of"]
    [::std::mem::offset_of!(whisper_full_params__bindgen_ty_1, best_of) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_full_params__bindgen_ty_2 {
  pub beam_size: ::std::os::raw::c_int,
  pub patience: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of whisper_full_params__bindgen_ty_2"]
    [::std::mem::size_of::<whisper_full_params__bindgen_ty_2>() - 8usize];
  ["Alignment of whisper_full_params__bindgen_ty_2"]
    [::std::mem::align_of::<whisper_full_params__bindgen_ty_2>() - 4usize];
  ["Offset of field: whisper_full_params__bindgen_ty_2::beam_size"]
    [::std::mem::offset_of!(whisper_full_params__bindgen_ty_2, beam_size) - 0usize];
  ["Offset of field: whisper_full_params__bindgen_ty_2::patience"]
    [::std::mem::offset_of!(whisper_full_params__bindgen_ty_2, patience) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of whisper_full_params"][::std::mem::size_of::<whisper_full_params>() - 304usize];
  ["Alignment of whisper_full_params"][::std::mem::align_of::<whisper_full_params>() - 8usize];
  ["Offset of field: whisper_full_params::strategy"]
    [::std::mem::offset_of!(whisper_full_params, strategy) - 0usize];
  ["Offset of field: whisper_full_params::n_threads"]
    [::std::mem::offset_of!(whisper_full_params, n_threads) - 4usize];
  ["Offset of field: whisper_full_params::n_max_text_ctx"]
    [::std::mem::offset_of!(whisper_full_params, n_max_text_ctx) - 8usize];
  ["Offset of field: whisper_full_params::offset_ms"]
    [::std::mem::offset_of!(whisper_full_params, offset_ms) - 12usize];
  ["Offset of field: whisper_full_params::duration_ms"]
    [::std::mem::offset_of!(whisper_full_params, duration_ms) - 16usize];
  ["Offset of field: whisper_full_params::translate"]
    [::std::mem::offset_of!(whisper_full_params, translate) - 20usize];
  ["Offset of field: whisper_full_params::no_context"]
    [::std::mem::offset_of!(whisper_full_params, no_context) - 21usize];
  ["Offset of field: whisper_full_params::no_timestamps"]
    [::std::mem::offset_of!(whisper_full_params, no_timestamps) - 22usize];
  ["Offset of field: whisper_full_params::single_segment"]
    [::std::mem::offset_of!(whisper_full_params, single_segment) - 23usize];
  ["Offset of field: whisper_full_params::print_special"]
    [::std::mem::offset_of!(whisper_full_params, print_special) - 24usize];
  ["Offset of field: whisper_full_params::print_progress"]
    [::std::mem::offset_of!(whisper_full_params, print_progress) - 25usize];
  ["Offset of field: whisper_full_params::print_realtime"]
    [::std::mem::offset_of!(whisper_full_params, print_realtime) - 26usize];
  ["Offset of field: whisper_full_params::print_timestamps"]
    [::std::mem::offset_of!(whisper_full_params, print_timestamps) - 27usize];
  ["Offset of field: whisper_full_params::token_timestamps"]
    [::std::mem::offset_of!(whisper_full_params, token_timestamps) - 28usize];
  ["Offset of field: whisper_full_params::thold_pt"]
    [::std::mem::offset_of!(whisper_full_params, thold_pt) - 32usize];
  ["Offset of field: whisper_full_params::thold_ptsum"]
    [::std::mem::offset_of!(whisper_full_params, thold_ptsum) - 36usize];
  ["Offset of field: whisper_full_params::max_len"]
    [::std::mem::offset_of!(whisper_full_params, max_len) - 40usize];
  ["Offset of field: whisper_full_params::split_on_word"]
    [::std::mem::offset_of!(whisper_full_params, split_on_word) - 44usize];
  ["Offset of field: whisper_full_params::max_tokens"]
    [::std::mem::offset_of!(whisper_full_params, max_tokens) - 48usize];
  ["Offset of field: whisper_full_params::debug_mode"]
    [::std::mem::offset_of!(whisper_full_params, debug_mode) - 52usize];
  ["Offset of field: whisper_full_params::audio_ctx"]
    [::std::mem::offset_of!(whisper_full_params, audio_ctx) - 56usize];
  ["Offset of field: whisper_full_params::tdrz_enable"]
    [::std::mem::offset_of!(whisper_full_params, tdrz_enable) - 60usize];
  ["Offset of field: whisper_full_params::suppress_regex"]
    [::std::mem::offset_of!(whisper_full_params, suppress_regex) - 64usize];
  ["Offset of field: whisper_full_params::initial_prompt"]
    [::std::mem::offset_of!(whisper_full_params, initial_prompt) - 72usize];
  ["Offset of field: whisper_full_params::carry_initial_prompt"]
    [::std::mem::offset_of!(whisper_full_params, carry_initial_prompt) - 80usize];
  ["Offset of field: whisper_full_params::prompt_tokens"]
    [::std::mem::offset_of!(whisper_full_params, prompt_tokens) - 88usize];
  ["Offset of field: whisper_full_params::prompt_n_tokens"]
    [::std::mem::offset_of!(whisper_full_params, prompt_n_tokens) - 96usize];
  ["Offset of field: whisper_full_params::language"]
    [::std::mem::offset_of!(whisper_full_params, language) - 104usize];
  ["Offset of field: whisper_full_params::detect_language"]
    [::std::mem::offset_of!(whisper_full_params, detect_language) - 112usize];
  ["Offset of field: whisper_full_params::suppress_blank"]
    [::std::mem::offset_of!(whisper_full_params, suppress_blank) - 113usize];
  ["Offset of field: whisper_full_params::suppress_nst"]
    [::std::mem::offset_of!(whisper_full_params, suppress_nst) - 114usize];
  ["Offset of field: whisper_full_params::temperature"]
    [::std::mem::offset_of!(whisper_full_params, temperature) - 116usize];
  ["Offset of field: whisper_full_params::max_initial_ts"]
    [::std::mem::offset_of!(whisper_full_params, max_initial_ts) - 120usize];
  ["Offset of field: whisper_full_params::length_penalty"]
    [::std::mem::offset_of!(whisper_full_params, length_penalty) - 124usize];
  ["Offset of field: whisper_full_params::temperature_inc"]
    [::std::mem::offset_of!(whisper_full_params, temperature_inc) - 128usize];
  ["Offset of field: whisper_full_params::entropy_thold"]
    [::std::mem::offset_of!(whisper_full_params, entropy_thold) - 132usize];
  ["Offset of field: whisper_full_params::logprob_thold"]
    [::std::mem::offset_of!(whisper_full_params, logprob_thold) - 136usize];
  ["Offset of field: whisper_full_params::no_speech_thold"]
    [::std::mem::offset_of!(whisper_full_params, no_speech_thold) - 140usize];
  ["Offset of field: whisper_full_params::greedy"]
    [::std::mem::offset_of!(whisper_full_params, greedy) - 144usize];
  ["Offset of field: whisper_full_params::beam_search"]
    [::std::mem::offset_of!(whisper_full_params, beam_search) - 148usize];
  ["Offset of field: whisper_full_params::new_segment_callback"]
    [::std::mem::offset_of!(whisper_full_params, new_segment_callback) - 160usize];
  ["Offset of field: whisper_full_params::new_segment_callback_user_data"]
    [::std::mem::offset_of!(whisper_full_params, new_segment_callback_user_data) - 168usize];
  ["Offset of field: whisper_full_params::progress_callback"]
    [::std::mem::offset_of!(whisper_full_params, progress_callback) - 176usize];
  ["Offset of field: whisper_full_params::progress_callback_user_data"]
    [::std::mem::offset_of!(whisper_full_params, progress_callback_user_data) - 184usize];
  ["Offset of field: whisper_full_params::encoder_begin_callback"]
    [::std::mem::offset_of!(whisper_full_params, encoder_begin_callback) - 192usize];
  ["Offset of field: whisper_full_params::encoder_begin_callback_user_data"]
    [::std::mem::offset_of!(whisper_full_params, encoder_begin_callback_user_data) - 200usize];
  ["Offset of field: whisper_full_params::abort_callback"]
    [::std::mem::offset_of!(whisper_full_params, abort_callback) - 208usize];
  ["Offset of field: whisper_full_params::abort_callback_user_data"]
    [::std::mem::offset_of!(whisper_full_params, abort_callback_user_data) - 216usize];
  ["Offset of field: whisper_full_params::logits_filter_callback"]
    [::std::mem::offset_of!(whisper_full_params, logits_filter_callback) - 224usize];
  ["Offset of field: whisper_full_params::logits_filter_callback_user_data"]
    [::std::mem::offset_of!(whisper_full_params, logits_filter_callback_user_data) - 232usize];
  ["Offset of field: whisper_full_params::grammar_rules"]
    [::std::mem::offset_of!(whisper_full_params, grammar_rules) - 240usize];
  ["Offset of field: whisper_full_params::n_grammar_rules"]
    [::std::mem::offset_of!(whisper_full_params, n_grammar_rules) - 248usize];
  ["Offset of field: whisper_full_params::i_start_rule"]
    [::std::mem::offset_of!(whisper_full_params, i_start_rule) - 256usize];
  ["Offset of field: whisper_full_params::grammar_penalty"]
    [::std::mem::offset_of!(whisper_full_params, grammar_penalty) - 264usize];
  ["Offset of field: whisper_full_params::vad"]
    [::std::mem::offset_of!(whisper_full_params, vad) - 268usize];
  ["Offset of field: whisper_full_params::vad_model_path"]
    [::std::mem::offset_of!(whisper_full_params, vad_model_path) - 272usize];
  ["Offset of field: whisper_full_params::vad_params"]
    [::std::mem::offset_of!(whisper_full_params, vad_params) - 280usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_vad_context {
  _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_vad_context_params {
  pub n_threads: ::std::os::raw::c_int,
  pub use_gpu: bool,
  pub gpu_device: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of whisper_vad_context_params"]
    [::std::mem::size_of::<whisper_vad_context_params>() - 12usize];
  ["Alignment of whisper_vad_context_params"]
    [::std::mem::align_of::<whisper_vad_context_params>() - 4usize];
  ["Offset of field: whisper_vad_context_params::n_threads"]
    [::std::mem::offset_of!(whisper_vad_context_params, n_threads) - 0usize];
  ["Offset of field: whisper_vad_context_params::use_gpu"]
    [::std::mem::offset_of!(whisper_vad_context_params, use_gpu) - 4usize];
  ["Offset of field: whisper_vad_context_params::gpu_device"]
    [::std::mem::offset_of!(whisper_vad_context_params, gpu_device) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct whisper_vad_segments {
  _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data {
  pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_multibyte_data {
  pub _address: u8,
}
pub type __builtin_va_list = *mut ::std::os::raw::c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ggml_backend_buffer {
  pub _address: u8,
}
pub struct WhisperCppRaw {
  __library: ::libloading::Library,
  pub __va_start:
    Result<unsafe extern "C" fn(arg1: *mut *mut ::std::os::raw::c_char, ...), ::libloading::Error>,
  pub __security_init_cookie: Result<unsafe extern "C" fn(), ::libloading::Error>,
  pub __security_check_cookie:
    Result<unsafe extern "C" fn(_StackCookie: usize), ::libloading::Error>,
  pub __report_gsfailure:
